Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: དགེ་བའི་བཤེས་གཉེན་ནི་དགེ་བའི་ཆོས་ཐམས་ཅད་ཀྱི་འབྱུང་གནས་སོ། །
en: Because the kalyāṇamitras are the source of all good Dharmas, and the attainment of omniscience is dependent on the kalyāṇamitras.”

source: དགེ་བའི་བཤེས་གཉེན་ལ་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རག་ལུས་སོ་ཞེས་དེ་དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པས་སྤྱོད་པ་ཐུབ་པར་དཀའ་བ་དེ་མཐར་གྱིས་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་དེར་ཕྱིན་ནས་མཉན་པ་དཔའ་བོ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས་གྲོང་ཁྱེར་ཆེན་པོ་ཞིག་གི་སྒོ་རྒྱ་མཚོ་ཆེན་པོའི་ངོགས་ན།
en: With his mind focused on those thoughts, and undergoing a difficult journey, he eventually arrived at the city of Kūṭāgāra.

source: མཉན་པ་དཔའ་བོ་དེ་ཚོང་པ་བརྒྱ་ཕྲག་སྟོང་ཙམ་དང་།
en: He looked and searched for the mariner Vaira and saw him at the shore of the ocean in front of the gate of the great city.

source: སྲོག་ཆགས་བརྒྱ་སྟོང་དུ་མ་གཏམ་སྣ་ཚོགས་མཉན་པར་འདོད་པ་ཤ་སྟག་གིས་ཀུན་ནས་བསྐོར་ཅིང་།
en: He was encircled by a hundred thousand merchants and many hundreds of thousands of people who all wished to listen to his various tales.

source: རྒྱ་མཚོའི་གཏམ་ཡོངས་སུ་བརྗོད་པས། སངས་རྒྱས་ཀྱི་ཡོན་ཏན་རྒྱ་མཚོ་སེམས་ཅན་རྣམས་ལ་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་། །
en: As he told them tales of the sea, he was teaching the beings about the ocean of qualities of the buddhas.

source: མཐོང་ནས་ཀྱང་མཉན་པ་དཔའ་བོ་གང་ན་བ་དེར་སོང་སྟེ།
en: When Sudhana saw the mariner Vaira, he approached him.

source: ཕྱིན་ནས་མཉན་པ་དཔའ་བོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཉན་པ་དཔའ་བོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། མཉན་པ་དཔའ་བོའི་མདུན་དུ་འདུག་སྟེ།
en: Having approached him, Sudhana bowed his head to the mariner Vaira’s feet, circumambulated the mariner Vaira many hundreds of thousands of times, and sat down before the mariner Vaira.

source: འཕགས་པ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བགྱི་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་བདག་ལ་བཀའ་སྩལ་དུ་གསོལ། སྨྲས་པ་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ། ཡེ་ཤེས་ཆེན་པོ་འཐོབ་པ་འབྱུང་བའི་རྒྱུ་འདྲི་བ་དང་། འཁོར་བའི་སྡུག་བསྔལ་སྣ་ཚོགས་ཀྱི་རྒྱུད་འགྱུར་བའི་རྒྱུ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གླིང་གི་གནས་སུ་འགྲོ་བ་འབྱུང་བའི་རྒྱུ་དང་། དབྱེར་མེད་པའི་ཐེག་པ་ཆེན་པོ་འབྱུང་བའི་རྒྱུ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བས་འཇིགས་པ་དང་འབྲལ་བར་འགྱུར་བའི་ལམ་གྱི་ནན་ཏན་འབྱུང་བའི་རྒྱུ་དང་། ཞི་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་དང་། རྒྱུད་སྣ་ཚོགས་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཡེ་ཤེས་ཀྱི་ལམ་འབྱུང་བའི་རྒྱུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་དུ་འགྲོ་བས་རྣམ་པར་སྤྱོད་པའི་སྨོན་ལམ་གྱི་ཤིང་རྟའི་འཁོར་ལོ་ཐོགས་པ་མེད་པའི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་གཟི་བརྗིད་ཀྱི་དབའ་རླབས་ཀྱིས་རྣམ་པར་བརྒྱན་པ་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་། ཚུལ་གྱི་ལམ་འབྱུང་བ་དང་།
en: I pray that you explain to me how bodhisattvas should train in bodhisattva conduct and how they should practice it!”

source: རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་དང་། ཆོས་ཀྱི་ཕྱོགས་དང་། སྒོ་ཐམས་ཅད་ཀྱི་ཕྱི་མའི་མཐའི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་དང་། ཐམས་ཅད་མཁྱེན་པའི་རྒྱ་མཚོར་འཇུག་པའི་ལམ་འབྱུང་བ་དང་། རྣམ་པར་དག་པར་འགྱུར་བའི་རྒྱུ་འདི་འདྲི་བ་ལེགས་སོ་ལེགས་སོ། །
en: Vaira said, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment, that you have asked about the cause of great wisdom, the cause of the continuity of the various sufferings of saṃsāra, the cause of journeying to the island of omniscience, the cause of the indivisible Mahāyāna, the cause of the practice of the path that is free from the fear of falling down to the level of the śrāvakas and pratyeka­buddhas, the cause of the path of knowledge that comprehends engaging in the gateways of various samādhis of peace, the cause of the pure and unimpeded path of the wheels of the chariot of the aspiration to the practice of all-pervasive bodhisattva conduct, the cause of the pure path of the way that is the nature of the display of all the majestic waves of bodhisattva conduct, the cause of the pure ultimate path of all the aspects and gateways of the Dharma, and the cause that gives rise to the pure path for entering the ocean of omniscience.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་རྒྱ་མཚོའི་ངོགས་ཀྱི་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་འདི་ན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྙིང་རྗེ་ཆེན་པོའི་རྒྱལ་མཚན་ཡོངས་སུ་སྦྱོང་ཞིང་གནས་ཏེ།
en: “Noble one, I dwell at the city of Kūṭāgāra on the seashore, purifying the bodhisattva conduct called the banner of great compassion.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཕོངས་པ་རྣམས་མཐོང་ནས། དེ་དག་གི་དོན་དུ་དཀའ་བ་སྤྱོད་དེ། དེ་དག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱའོ། །
en: “Noble one, when I see destitute beings in Jambudvīpa, I undergo hardships for their sake, which means I will fulfill all their wishes.

source: འཇིག་རྟེན་གྱི་ཟང་ཟིང་གིས་ཡོངས་སུ་བསྡུ་བར་བྱའོ། །
en: I will collect worldly goods for them.

source: ཆོས་ཀྱི་ལོངས་སྤྱོད་ཀྱིས་དེ་དག་ཡོངས་སུ་ཚིམ་པར་བྱའོ། །
en: I will satisfy them with the enjoyment of the Dharma.

source: དེ་དག་ལ་བསོད་ནམས་ཀྱི་ཚོགས་ཀྱི་ལམ་མན་ངག་དུ་བསྟན་པར་བྱའོ། །
en: I will teach them the instructions for the path of the accumulation of merit.

source: ཡེ་ཤེས་ཀྱི་ཚོགས་རྣམ་པར་སྤེལ་བར་བྱའོ། །
en: I will cause them to increase their accumulation of wisdom.

source: དགེ་བའི་རྩ་བའི་སྟོབས་ཡོངས་སུ་སྤེལ་བར་བྱའོ། །
en: I will increase the power of their roots of merit.

source: བྱང་ཆུབ་ཀྱི་སེམས་བསྐྱེད་པར་བྱའོ། །
en: I will cause them to develop the aspiration for enlightenment.

source: བྱང་ཆུབ་ཀྱི་བསམ་པ་རྣམ་པར་དག་པར་བྱའོ། །
en: I will purify their aspiration for enlightenment.

source: སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་ཉེ་བར་བརྟན་པར་བྱའོ། །
en: I will cause them to have the enduring strength of great compassion.

source: འཁོར་བའི་སྡུག་བསྔལ་རྣམ་པར་ཞི་བར་བྱའོ། །
en: I will cause the suffering of saṃsāra to cease.

source: འཁོར་བའི་སྤྱོད་པས་ཡོངས་སུ་མི་སྐྱོ་བའི་སྟོབས་ཤིན་ཏུ་བརྟན་པར་བྱའོ། །
en: I will cause them to have an enduring strength for tireless conduct in saṃsāra.

source: སེམས་ཅན་རྒྱ་མཚོ་བསྡུ་བ་ལ་འདི་དག་སྦྱར་བར་བྱའོ། །
en: I will provide these to the gathering of an ocean of beings.

source: ཡོན་ཏན་རྒྱ་མཚོའི་ནན་ཏན་གྱི་སྒོ་ལ་དགོད་པར་བྱའོ། །
en: I will bring them into the gateways of the practice of an ocean of qualities.

source: འདི་དག་ལ་ཆོས་རྒྱ་མཚོའི་ཡེ་ཤེས་སྣང་བ་ཉེ་བར་བསྒྲུབ་པར་བྱའོ། །
en: I will cause them to obtain the light of the wisdom of the ocean of the Dharma.

source: སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱང་འདི་དག་གིས་མངོན་པར་མཐོང་བར་བྱའོ། །
en: I will cause them to see the entire ocean of buddhas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱ་མཚོ་ལ་ཡང་འདི་དག་གཟུད་པར་བྱའོ་ཞེས་དེ་ལྟ་བུའི་བསམ་པ་དང་།
en: I will cause them to enter the ocean of omniscience.

source: ཡིད་ལ་བྱ་བ་ལ་བརྩོན་པར་ཁོ་བོས་རྒྱ་མཚོའི་ངོགས་ཀྱི་གྲོང་ཁྱེར་ཁང་པ་བརྩེགས་པ་འདི་ན་གནས་སོ། །
en: “Noble one, it is with such an aspiration and intention that I dwell in the city of Kūṭāgāra on the seashore.

source: རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་ལྟར་འགྲོ་བ་ལ་ཕན་པ་དང་། བདེ་བར་བརྩོན་པས་རྒྱ་མཚོ་ཆེན་པོའི་རིན་པོ་ཆེའི་གླིང་ཐམས་ཅད་ཀྱང་ཤེས་སོ། །
en: “Noble one, dedicated in that way to the benefit and happiness of beings, I know all the islands of jewels in the great ocean.

source: རིན་པོ་ཆེའི་འབྱུང་གནས་ཐམས་ཅད་དང་། །རིན་པོ་ཆེའི་རིགས་ཐམས་ཅད་དང་། རིན་པོ་ཆེའི་གཏོས་ཐམས་ཅད་ཀྱང་རབ་ཏུ་ཤེས་སོ། །ཀླུའི་གནས་ཐམས་ཅད་དང་།
en: I know all the jewel mines, all the classes of jewels, and all the sources of jewels.

source: ཀླུའི་འཁྲུག་པ་ཐམས་ཅད་དང་། གནོད་སྦྱིན་གྱི་གནས་ཐམས་ཅད་དང་། གནོད་སྦྱིན་འཁྲུག་པ་ཐམས་ཅད་དང་། སྲིན་པོའི་གནས་ཐམས་ཅད་དང་། སྲིན་པོའི་འཇིགས་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་བྱ་བ་དང་།
en: “I know all the residences of the nāgas, all that disconcerts the nāgas, all the residences of the yakṣas, all that disconcerts the yakṣas, all the residences of the rākṣasas, all that allays fear of the rākṣasas, all the residences of the bhūtas, all that allays fear of the bhūtas, and all that eliminates the obstacles created by the bhūtas.

source: འབྱུང་པོའི་གནས་ཐམས་ཅད་དང་། འབྱུང་པོའི་བར་ཆད་ཐམས་ཅད་རྣམ་པར་ཞི་བར་བྱ་བ་ཡང་རབ་ཏུ་ཤེས་ཏེ། གློང་ཡོད་པ་ཐམས་ཅད་གློང་ཐམས་ཅད་བཀོལ་བ་དང་དབའ་རླབས་ཆེན་པོ་ཡོངས་སུ་སྤང་བ་དང་། ཆུའི་ཁ་དོག་རྣམ་པ་ཐ་དད་པའང་རབ་ཏུ་ཤེས་སོ། །
en: “I know all whirlpools, the avoidance of whirlpools, and the avoidance of great waves.

source: གཉི་ཟླ་དང་གཟའ་སྐར་གྱི་ཚོགས་ཡོངས་སུ་འཁོར་བ་དང་། ཉིན་ཞག་དང་སྐད་ཅིག་དང་། ཡུད་ཙམ་དང་ཐག་ཅིག་ཀྱང་རབ་ཏུ་ཤེས་སོ། །ཕན་ཚུན་དུ་འགྲོ་བའི་ཤོལ་འདུམས་དང་། བདེ་མི་བདེ་དང་། གྲུའི་འཁྲུལ་འཁོར་བརྟན་པར་བྱ་བ་དང་།
en: “I know the orbits of the sun, moon, planets, and constellations and the seconds, minutes, and hours of the days and nights.

source: གྲུ་བཟུར་བ་དང་། གྲུ་ཕུལ་བ་དང་། རླུང་བརྔོ་བ་དང་རླུང་བསྐྱེད་པ་དང་། གྲུ་བསྒྱུར་ཞིང་བཟློག་པ་དང་། གྲུ་བརྟོད་པ་དང་།
en: “I know the particular times to depart and arrive, safety and danger, whether a ship’s rigging is reliable, what ships to reject, what ships to sail, how to catch the winds, the coming of the wind, how to turn a ship, how to turn a ship around, how to anchor a ship, and how to launch a ship.

source: གྲུ་བཏང་བ་ཡང་རབ་ཏུ་ཤེས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་ནི་ཤེས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་རྟག་ཏུ་སེམས་ཅན་གྱི་དོན་དང་དགོས་པ་བྱེད་དེ། ཚོང་པའི་ཚོགས་གྲུ་བརྟན་པོས་ལམ་བདེ་ཞིང་ཉེ་ཞོར་མི་འགྱུར་ལ་མི་འཇིགས་པ་ནས། ཆོས་ཀྱི་གཏམ་གྱིས་དགའ་བ་དང་། སྤྲོ་བ་བསྐྱེད་ཅིང་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རིན་པོ་ཆེའི་གླིང་དུ་ཕྱིན་པར་བྱས་ནས།
en: “Noble one, with that kind of knowledge I am constantly dedicated to necessary benefits for beings: I bring a group of merchants, just as they wish, to the island of jewels safely, peacefully, without fear, and in a reliable ship, and I talk to them about the Dharma in a way that delights them and brings them joy.

source: དེ་དག་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་ཚོགས་ཏེ།
en: When they have collected all the jewels and have attained good fortune, I bring them back again to Jambudvīpa.

source: ཕུན་སུམ་ཚོགས་པར་གྱུར་པ་དང་། ཕྱིར་ཡང་འཛམ་བུའི་གླིང་དུ་འགྱེད་འགྱེད་ཀྱང་རིགས་ཀྱི་བུ་ཁོ་བོའི་གྲུ་ནི་ནམ་ཡང་བུབ་པའམ། ཉེ་ཞོར་གྱུར་མ་མྱོང་སྟེ།
en: “Noble one, no ship of mine has ever been in distress.

source: སེམས་ཅན་གང་གིས་ཁོ་བོ་མཐོང་བར་གྱུར་པ་དང་། སེམས་ཅན་གང་གིས་ཁོ་བོའི་ཆོས་བསྟན་པ་ཐོས་པ་དེ་དག་ཀྱང་འཁོར་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་ཉེ་ཞོར་འགྱུར་བའི་འཇིགས་པ་དང་བྲལ་བར་འགྱུར་རོ། །ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱ་མཚོར་འཇུག་པའི་ཡེ་ཤེས་ཀྱང་མངོན་སུམ་དུ་འགྱུར་རོ། །
en: Any being who sees me and any being who hears me teach the Dharma becomes free from all fear of sinking in the ocean of saṃsāra, and they turn toward the wisdom of entering the ocean of omniscience.

source: སྲེད་པའི་རྒྱ་མཚོ་བསྐམ་པའི་དོན་དུའང་རབ་ཏུ་འཇུག་པར་འགྱུར་ཏེ། དུས་གསུམ་རྒྱ་མཚོའི་ཡེ་ཤེས་སྣང་བའང་རབ་ཏུ་ཐོབ་བོ། །སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་རྒྱ་མཚོ་ཟད་པར་བྱ་བའི་ཕྱིར་ཡང་མངོན་པར་མོས་པར་འགྱུར་རོ། །
en: They become dedicated to drying up the ocean of craving, attain the light of the knowledge of the ocean of the three times, and make the aspiration to eliminate the ocean of the suffering of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་རྒྱ་མཚོའི་རྙོག་པ་དང་བར་བྱ་བའི་ཕྱིར་ཡང་རབ་ཏུ་བརྩོན་པར་འགྱུར་རོ། །
en: They become dedicated to purifying away the pollution in the ocean of the minds of all beings.

source: ཞིང་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་དག་པར་བྱ་བའི་ཕྱིར་ཡང་བརྩོན་འགྲུས་རྩོམ་པར་འགྱུར་རོ། །
en: They become dedicated to purifying the ocean of all realms.

source: ཕྱོགས་རྒྱ་མཚོ་ཐམས་ཅད་རྒྱས་པར་གང་བ་ལས་ཀྱང་ཕྱིར་མི་ལྡོག་པར་འགྱུར་རོ། །
en: They never turn back from spreading throughout the ocean of all directions.

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་རྒྱ་མཚོ་ཐ་དད་པའང་ཁོང་དུ་ཆུད་པར་འགྱུར་རོ། །
en: They comprehend the ocean of the different capabilities of all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་རྒྱ་མཚོའི་རྗེས་སུའང་འབྲང་བར་འགྱུར་རོ། །འགྲོ་བའི་བསམ་པ་རྒྱ་མཚོ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་གཟུགས་བརྙན་འབྱུང་བར་འགྱུར་རོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་མཐོང་བ་དང་། ཐོས་པ་དང་འགྲོགས་པ་དང་། རྗེས་སུ་དྲན་པའི་ཆུ་ཀླུང་གི་དབྱངས་ཤེས་བྱ་བ་ཐོབ་པར་ཟད་ན་ཁོ་བོས་བྱང་ཆུབ་སེམས་དཔའ་འཁོར་བའི་རྒྱ་མཚོ་ཐམས་ཅད་དུ་རྣམ་པར་སྤྱོད་པ་ཉོན་མོངས་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱིས་གོས་པ་མེད་པ།
en: They follow the ocean of the conducts of all beings.

source: ལྟ་བའི་རྣམ་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་ཆགས་པའི་ཆུ་སྲིན་གྱི་འཇིགས་པ་དང་བྲལ་བ། ཆོས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རང་བཞིན་དང་། གཞི་ལས་རྣམ་པར་རྒྱུ་བ། འགྲོ་བ་རྒྱ་མཚོ་ཐམས་ཅད་བསྡུ་བའི་དངོས་པོས་ཡོངས་སུ་སྡུད་པའི་རྒྱ་མཚོ་དང་ལྡན་པ།
en: They manifest appearances that accord with the ocean of the wishes of all beings.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རྒྱ་མཚོ་དང་འགྲོགས་པ། སེམས་ཅན་གྱི་མངོན་པར་ཆགས་པའི་རྒྱ་མཚོ་ཐམས་ཅད་རབ་ཏུ་བསྲུབ་པ། དུས་རྒྱ་མཚོ་ཐམས་ཅད་དང་། ཐ་མི་དད་པར་རྣམ་པར་སྤྱོད་པ། འགྲོ་བ་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དམིགས་པ་ཤེས་པ།
en: “Noble one, I have attained the bodhisattva liberation called remembering to abide with the fruitfulhearing and seeing of the banner of great compassion, but how could I know the conduct or describe the qualities of the bodhisattvas who act within all the oceans of saṃsāra, who are unstained by any of the oceans of saṃsāra, who are free from the fear of the makaras of attachment in all the oceans of false views, who move among the nature and basis of all phenomena, who possess an ocean of the methods of gathering all the oceans of beings, who dwell within the ocean of omniscience, who churn the ocean of the attachments of all beings, who perform their conduct without differentiation in the oceans of all times, who have the clairvoyant knowledge of the nature of ripening the ocean of all beings, and who never miss the time for guiding the ocean of beings?

source: འགྲོ་བ་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་འདུལ་བའི་དབྲེས་ལས་མི་འདའ་བར་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་ལྷོ་ཕྱོགས་ཀྱི་རྒྱུད་འདི་ཉིད་ན་གྲོང་ཁྱེར་དགའ་བའི་ཕྲེང་བ་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་ཚོང་དཔོན་རྒྱལ་བ་དམ་པ་ཞེས་བྱ་བ་འདུག་གིས།
en: In this southern region, in the town called Nandihāra, dwells a head merchant by the name of Jayottama.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་མཉན་པ་དཔའ་བོའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས།
en: Then Sudhana, the head merchant’s son, was overjoyed, pleased, happy, and content.

source: མཉན་པ་དཔའ་བོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ཏེ། ཡང་དང་ཡང་བལྟས་ནས་གདོང་མཆི་མས་བཀང་སྟེ། ངུ་ཞིང་། དགེ་བའི་བཤེས་གཉེན་བལྟ་བས་མ་ངོམས་བཞིན་དུ་མཉན་པ་དཔའ་བོའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ། །བམ་པོ་བཞི་བ།
en: He bowed his head to the feet of the mariner Vaira, circumambulated the mariner Vaira many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the mariner Vaira.

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་བྱམས་པ་ཆེན་པོས་སེམས་ཅན་གྱི་ཁམས་ཚད་མེད་པར་རྒྱས་བའི་སེམས་དང་ལྡན་པ། སྙིང་རྗེ་ཆེན་པོའི་རླན་གྱིས་མངོན་པར་བརླན་པའི་རྒྱུད་ཅན། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་ཚོགས་རྒྱ་ཆེན་པོའི་རྒྱན་ཤིན་ཏུ་བསྩགས་པ་ཉོན་མོངས་པའི་རྡུལ་དང་མུན་པ་དང་དྲི་མ་དང་འདམ་ཐམས་ཅད་དང་བྲལ་བ། ཆོས་མཉམ་པ་ཉིད་ཁོང་དུ་ཆུད་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་གྱེན་ཐུར་མེད་པ་ལ་ཞུགས་པ། དགེ་བའི་ཆོས་ཚད་མེད་པ་ལ་འཇུག་པའི་སྒོར་ཞུགས་པ། མི་དགེ་བ་ཐམས་ཅད་ཀྱིས་མི་ཤིགས་པའི་བརྩོན་འགྲུས་བརྟན་པའི་མཐུ་སྔོན་དུ་འདོར་བ་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བསམ་གྱིས་མི་ཁྱབ་པ་རབ་ཏུ་བྱང་བ། རྒྱ་ཆེན་པོའི་བདེ་བ་རབ་ཏུ་ཐོབ་པ། ཤེས་རབ་ཀྱི་ཉི་མའི་འོད་ཟེར་སྣང་བས། མ་རིག་པའི་མུན་པ་མ་ལུས་པ་བསལ་བ། ཐབས་ཀྱི་སེར་བུ་བདེ་ཞིང་བསིལ་བས་བླགས་པའི་ཡེ་ཤེས་ཀྱི་མེ་ཏོག་གིས་རྒྱས་པ། སྨོན་ལམ་ཆེན་པོའི་རྒྱ་མཚོར་འབྱུང་བའི་ཡེ་ཤེས་ཀྱི་ཚུལ་དང་མཐུན་པ། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ཐོགས་པ་མེད་པར་རྒྱས་པར་འགེངས་པའི་ཡེ་ཤེས་དང་ལྡན་པ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕོ་བྲང་དུ་ཐོགས་པ་མེད་པར་འགྲོ་བ་ལ་མངོན་དུ་གྱུར་པ། བྱང་ཆུབ་སེམས་དཔའི་ལམ་ལ་མངོན་པར་མོས་པ་དེ།
en: Jayottama Chapter 26 Then Sudhana, the head merchant’s son, whose mind spread great love throughout the immeasurable realm of beings; whose being was saturated with the tenderness of great compassion; who had accumulated a vast array of the accumulations of merit and wisdom; who had become free of all the dust, darkness, dirt, and mire of the kleśas; who had realized the equality of all phenomena; who was devoted to the path that leads upward to omniscience; who had chosen the gateway for entering into immeasurable good qualities; who had the exertion of firm diligence that is unimpaired by any bad quality; who was filled with the vast calmness of inconceivable bodhisattva samādhis; who shone with the light of the sun of wisdom that eliminated all the darkness of ignorance; who scattered flowers of wisdom brought by the pleasant, cool breezes of methods; who followed the way of wisdom that emerged from an ocean of great aspirations; and who possessed the wisdom that permeated without impediment the entire realm of the Dharma—he had approached entry into the city of faultless omniscience, and he yearned for the bodhisattva path.

source: གྲོང་ཁྱེར་དགའ་བའི་ཕྲེང་བ་གང་ན་བ་དེར་ཕྱིན་ཏེ། ཚོང་དཔོན་རྒྱལ་བ་དམ་པ་ཡོངས་སུ་རྨེད་ཅིང་ཚོལ་ཚོལ་བ་ལས།
en: He arrived at the town called Nandihāra and looked and searched for the head merchant Jayottama.

source: གྲོང་ཁྱེར་དགའ་བའི་ཕྲེང་བའི་ཤར་ཕྱོགས་ལོགས་ཀྱི་འདབ་ཅིག་ན།
en: He saw him on the eastern edge of the town of Nandihāra, in a forest of ashoka trees that was called Vicitra­dhvaja.

source: ཤིང་ཨ་ཤོ་ཀའི་ནགས་ཚལ་རྒྱལ་མཚན་སྣ་ཚོགས་ཞེས་བྱ་བ་འདུག་པ་དེའི་ནང་ན་ཁྱིམ་བདག་སྟོང་ཕྲག་དུ་མ་ཞིག་གིས་བསྐོར་ཏེ། གྲོང་ཁྱེར་གྱི་བྱ་བ་སྣ་ཚོགས་ཡོངས་སུ་འགྲོ་ཞིང་དེ་ལས་བརྟེན་ཏེ། བདག་ཏུ་བྱ་བ་ཐམས་ཅད་ཡང་དག་པར་གཞོམ་པ་དང་། ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་།
en: He was encircled by many thousands of householders deciding upon various kinds of civic duties, and in reference to those he talked about the Dharma.

source: དངོས་པོར་འཛིན་པ་ཐམས་ཅད་རབ་ཏུ་སྤང་བ་དང་། མངོན་པར་ཞེན་པ་ཐམས་ཅད་ཤིན་ཏུ་གཞིག་པ་དང་། སྲེད་པའི་འཆིང་བ་ཐམས་ཅད་གཅད་པར་བྱ་བ་དང་། ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་ཀྱི་སྒོ་གླེགས་གཅག་པ་དང་། ཐེ་ཙོམ་དང་ཡིད་གཉིས་དང་། ནེམ་ནུར་གྱི་རབ་རིབ་ཐམས་ཅད་རྣམ་པར་བསལ་བ་དང་། གཡོ་སྒྱུའི་རྙོག་པ་ཤིན་ཏུ་གདང་བ་དང་། ཕྲག་དོག་དང་སེར་སྣའི་དྲི་མ་ཡོངས་སུ་སྦྱང་བ་དང་། སེམས་ཀྱི་མཚོ་ཤིན་ཏུ་གསལ་བར་བྱ་བ་དང་། སེམས་རྙོག་པ་མེད་པ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། དད་པ་རྙོག་པ་མེད་པའི་སྟོབས་བསྐྱེད་དེ། སངས་རྒྱས་བལྟ་བར་མོས་པ་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བསྔགས་ཤིང་།
en: He was teaching the Dharma for the sake of eliminating all egotism; abandoning all possessiveness; rejecting all attachment; forsaking all fixation on things; destroying all clinging; cutting through all the bondage of craving; breaking down the doors of all views; clearing away the darkness of doubt, uncertainty, and equivocation; cleansing away the dirt of illusion and deceit; purifying the stains of envy and miserliness; clarifying the lake of the mind; bringing beings to a state of unpolluted mentality; giving rise to an unpolluted faith; giving rise to the aspiration to see the buddhas; eulogizing the power of bodhisattvas; receiving the Dharma of the buddhas; aspiring to bodhisattva conduct; giving rise to the power of bodhisattva samādhi; teaching the power of bodhisattva wisdom; and attaining the highest purity of the power of bodhisattva memory.

source: སངས་རྒྱས་ཀྱི་ཆོས་ཡང་དག་པར་བླང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྨོས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཡོངས་སུ་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཤེས་རབ་ཀྱི་སྟོབས་ཡང་དག་པར་སྟོན་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་དྲན་པའི་སྟོབས་རྣམ་པར་དག་པའི་མཐར་ཕྱིན་པར་བྱ་བའི་ཕྱིར།
en: This means that he was teaching the Dharma in order to inspire the aspiration to enlightenment.

source: ཆོས་ཀྱི་གཏམ་བྱེད་ཅིང་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལ་མངོན་པར་མོས་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཅིང་འདུག་པ་མཐོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་གཏམ་དེའི་རྗེས་ཆད་ཆད་དུ་བསྡད་ནས་ཚོང་དཔོན་རྒྱལ་བ་དམ་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Then when the teaching was concluded, Sudhana, the head merchant’s son, approached and bowed his head to the feet of the head merchant Jayottama.

source: རིང་མོ་ཞིག་ཏུ་བཏུད་ནས་ཆོས་ལ་ཤིན་ཏུ་གུས་པའི་བསམ་པས་ཚིག་འདི་སྐད་དུ་བརྗོད་དོ། །འཕགས་པ་བདག་ནི་ནོར་བཟངས་ནོར་བཟངས་ཤེས་བགྱི་བ་སྟེ།
en: He bowed down to him for a long time and said, “Ārya, I am Sudhana, I am Sudhana!

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་ཚོལ་ན་ཅི་ནས་ཀྱང་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་སློབ་པར་འགྱུར་བ་དང་། བསླབས་ནས་ཀྱང་ཅི་ནས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། གདུལ་བའི་དོན་ལ་མངོན་དུ་མོས་པར་འགྱུར་བ་དང་།
en: I seek bodhisattva conduct.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞལ་བལྟ་བ་ལས་མི་འཕང་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཐོས་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཆར་ཡོངས་སུ་གཟུང་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་ཚུལ་ལ་ནན་ཏན་དུ་བགྱི་བ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་པ་དང་། བསྐལ་པ་ཐམས་ཅད་དུ་གནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་ཡོངས་སུ་མི་སྐྱོ་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བཙལ་བར་འགྱུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་བྱིན་གྱི་རླབས་ཡང་དག་པར་མནོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྟོབས་རྣམས་ལ་སྣང་བ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟར་འཕགས་པས་བདག་ལ་བཤད་དུ་གསོལ། །
en: Instruct me, Ārya, on how I should train in bodhisattva conduct and while training how I should aspire to guide and ripen all beings, not forsake seeing all the buddhas, hear the Dharma of all the buddhas, possess the rain from the clouds of the Dharma of all the buddhas, practice in the way of all the buddhas, practice bodhisattva conduct in all world realms, never tire of bodhisattva conduct while dwelling in all kalpas, comprehend the manifestations of all the tathāgatas, receive the blessing of all the buddhas, and attain splendor in the power of all the tathāgatas.”

source: དེ་ནས་ཚོང་དཔོན་རྒྱལ་བ་དམ་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་ལེགས་སོ་ལེགས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་འདི་ལྟ་སྟེ།
en: Then the head merchant Jayottama said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment.

source: དངོས་པོ་མེད་པ་ལ་གནས་པས་མངོན་པར་འདུ་བྱ་བ་མེད་པའི་རྫུ་འཕྲུལ་ཐོབ་པའི་མཐུས། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྒོ་ཐམས་ཅད་དུ་འགྲོ་བ་ཡོངས་སུ་སྦྱོང་སྟེ། དེ་ལྟར་ཁོ་བོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡོངས་སུ་དག་པའི་སྒོ་ཐམས་ཅད་དུ་འགྲོ་བ་འདི་ལ་གནས་ཤིང་།
en: “Noble one, I purify the gateway to omnipresent bodhisattva conduct through the power of the attainment of noncomposite miracles while residing in the absence of existence.
